package com.cyjh.elfin.receiver;

import android.content.BroadcastReceiver;
import android.content.Context;
import android.content.Intent;
import android.content.IntentFilter;
import androidx.fragment.app.FragmentManagerImpl;
import java.util.ArrayList;
import p285z2.C4381t4;

/* JADX INFO: loaded from: classes.dex */
public class NetStateReceiver extends BroadcastReceiver {
    private static final String OooO00o = "android.net.conn.CONNECTIVITY_CHANGE";
    private static final String OooO0O0;
    private static boolean OooO0OO;
    private static int OooO0Oo;
    private static BroadcastReceiver OooO0o;
    private static ArrayList<OooO00o> OooO0o0;

    public interface OooO00o {
        void OooO00o();

        void OooO0O0(int i);
    }

    static {
        String str = "ۢۢۗۘۘۤۢ۠ۢ۟ۡۙ۫۟ۢۢۢۙۜۨۘۘۥۖۡۘ۫ۦۘ۟ۦۥ۬ۤۖۘۦۧ۠";
        while (true) {
            switch ((((str.hashCode() ^ 105) ^ 526) ^ 192) ^ 708605684) {
                case -2114966065:
                    return;
                case -87546442:
                    OooO0O0 = NetStateReceiver.class.getSimpleName();
                    str = "ۡۙۤۚۤۤۢ۬۟ۗۛ۬ۚۜۜۙۧۦۘۙۢۜۘۧۙۡۢ۟ۢۥ۬ۖۘ";
                    break;
                case 394863179:
                    OooO0o0 = new ArrayList<>();
                    str = "ۚۥ۬۫ۛۧۦۥۛۦ۬ۤۡۦۘ۬۫ۛۥۗۨۨۤ۟ۧۨ۫ۙۥۡۦۗۦ۟ۢۛ";
                    break;
                case 554961742:
                    OooO0OO = false;
                    str = "ۢۚۢۧۙۜۢۙۡۘۨۥۖۧۜۨۘۨۙۘۘۢۖۡۚۥۖۘۡ۬ۛ۬ۚۥۘ";
                    break;
            }
        }
    }

    public static void OooO(Context context) {
        String str = "ۛۛۤ۬ۘۜۘۙۗۜۘۤۛۤۦۚۘۘ۬ۢۦ۠۠ۡۨۨۘۘ۠ۦۘۨ۫ۤۧۡ۟ۜۜۘۘۧۨۦۛۧ";
        while (true) {
            switch (str.hashCode() ^ (-1061600217)) {
                case 115880672:
                    String str2 = "ۗ۠ۡۘۥ۠ۥۤ۫ۨۘ۠ۦۡۨ۫ۧۖۗۜۘۥ۟ۥۚ۫ۘۡۜۦۚ۟ۜ";
                    while (true) {
                        switch (str2.hashCode() ^ (-1671636334)) {
                            case -1498557205:
                                str = "ۗۢۥۘۗ۫۟ۥۢۦۘۗ۠ۘۘۧۗۡۙۖۘۚۦۥ۠ۡ۟ۡ۬ۙۦ۬ۜ۟۬ۚۘ۫ۡۘ";
                                continue;
                            case 211336771:
                                str2 = "ۥۜۖ۫۠ۢۗۨۦۘ۫ۚۢۤۙۘ۠۫ۧۤۤۖ۬ۗۖۜ۟ۢ۟ۜ۫ۧۖۢۜ۟ۖۘ";
                                break;
                            case 600124759:
                                str = "۬ۜۨۘۢۖۤۧۙۘۙۤۜ۟ۙۤۜۨۖۜ۟ۧۡۤۗۦ۬ۡۡ۟ۧ۬ۧۜۨۖ۬ۨۨۘ۫ۡۦۥۨ۬۫ۜۖ۠ۖۘۨۧۡۘ";
                                continue;
                            case 1267200285:
                                str2 = OooO0o == null ? "۫ۛۖۡۜۦ۬ۘۤۙۡۘۘۘۜۡۜۤۥۘۡۧ۟ۜۛۡۘ۬ۢۜۙۢۢۨۙۨۢۤۛۦۡۡۜۖ۟ۦ۟ۥۘ۬ۙۛۛۥۘۤۗ" : "۬ۗۛۧۧۜۘۘۜۜۜۥۘۚۖۘۗۗ۠ۗ۬ۖۘ۠۠ۛۘۡۨۥ۠۬ۧۖۗۛۡۘۢۢۘۖۖۢۨۙۙ۠ۨۜ۫ۤۡۤۜ";
                                break;
                        }
                    }
                    break;
                case 210200895:
                    try {
                        context.getApplicationContext().unregisterReceiver(OooO0o);
                        return;
                    } catch (Exception e) {
                        return;
                    }
                case 1401555817:
                    return;
                case 2136172540:
                    str = "ۢ۬ۗۚ۫ۢ۬ۙۖۙۖۜۖۧۡۧۦۥۛ۬ۦۘۨۗۦۥۜۖۤ۫ۥ۫ۗۛۚۡۥۘۦۥۥۙۥۤ";
                    break;
            }
        }
    }

    public static void OooO00o(Context context) {
        Intent intent = null;
        String str = "ۧۚۗۨۤ۟ۜۨۤۥۖۡۖۗۥۡۖۥۥۘۦۘۦۜۘۢۚۖۘۡۧۤ";
        while (true) {
            switch ((((str.hashCode() ^ 697) ^ 172) ^ 959) ^ (-1414569650)) {
                case -1667061113:
                    return;
                case -1416995954:
                    str = "ۚ۟ۗۙۡۡۘۜۨۦۡ۠ۚ۠ۖۙۤۗۚۜۥۘۛۦۘۘۚۥۦۘۛۗۤۚ۠ۘۘۨۢ۫";
                    break;
                case -1019060695:
                    intent.setAction(OooO00o);
                    str = "ۨۜۨۘۗ۬ۢۗ۬ۡۚۧۦۖۘۛۜۨ۫ۖۧۘۧ۠ۜۘۗ۬ۘۢۖۘ";
                    break;
                case 175455461:
                    context.sendBroadcast(intent);
                    str = "ۦۤۚ۠ۛۧۤۙۜۥۙۖۘۡۙۗۗۗ۫ۥۡۜۧۧۢۡۦۘ۬ۖۖۘۜۨ۟ۘ۬ۖۘۧۤ۬ۨۡۦ";
                    break;
                case 284661344:
                    intent = new Intent();
                    str = "ۡۡۖ۠ۤۡۘۧۥۖۘۢۚ۫ۤۜۢۚۤۘۘۨۘۡۙۘ۠۫۫ۧۤ۬ۗۘۛۥۨۜ۠ۗ۬ۜۘۛۗۗۨۦۘ۟ۖۤۜ۫ۛ۫۠ۥ";
                    break;
            }
        }
    }

    public static int OooO0O0() {
        while (true) {
            switch (((("۟ۦۘۥۢۨۘۦ۫ۛۚۘۧۛ۬ۢۢ۫ۙۡۘۡۖۧۘ۫ۖۘۙۜ۫۬ۢ۫۠ۜ۟۫ۥۖۘۤۘ۠ۚۗۛۢۖ۟ۙۨۙۖ".hashCode() ^ 353) ^ 557) ^ 40) ^ 991633055) {
                case 13542568:
                    return OooO0Oo;
            }
        }
    }

    private static BroadcastReceiver OooO0OO() {
        String str = "ۘۗۜۘ۠ۙۘۘۙۚ۠۫ۧۖۜۦۙۜ۫۬ۡۢ۠ۨۙۥۧۘۖۘۚۙۥ۠ۧۚ۬ۤۘۗۧ۠ۗ۟ۛۛۡۦۘۢۥۡۘ";
        while (true) {
            switch (str.hashCode() ^ 494432573) {
                case -2084725843:
                    synchronized (NetStateReceiver.class) {
                        String str2 = "ۚۨۜ۠ۤۛۙۛ۫ۨۘۡۘۚ۬ۨۘۙۦ۬ۨۡۜۧۥۙۜۜۘۖۥۧ۫ۘۤ۟ۘ۠ۨۨۚۗ۟۠";
                        while (true) {
                            try {
                                switch (str2.hashCode() ^ (-717016789)) {
                                    case -1090836236:
                                        break;
                                    case -249135246:
                                        OooO0o = new NetStateReceiver();
                                        break;
                                    case 696429797:
                                        str2 = "۠ۧۥ۠ۛۙۗۖۤ۫ۖۗۥۦۜ۟ۖۘۡۢۘۘ۠۫۠ۧۧ۠۠ۦۘ";
                                        continue;
                                    case 809977879:
                                        String str3 = "ۤۤۙۛۖۜۖۦۥۘۤۖۤۛۘۚۗۢۘۘۥۚۧۨۡ۠ۖۘۧۖۤۚۛۧۜۙۘۙۚ۟ۧۡۧۤۨۖۤۢۘ۫ۗۗ۟ۦ۟";
                                        while (true) {
                                            switch (str3.hashCode() ^ (-831105433)) {
                                                case -1016677909:
                                                    str2 = "ۧۛۙۢۜۦۘۛۡ۠ۥۢ۟ۡۥۜۘۜۘ۠ۧۗۤ۠ۥۜۘ۫ۨۘۦ۟۫ۨۧ۟ۘۛ۫ۜۙ۫ۙۨۡۘۚۡۜۘۘۖ۫ۨۗ۫۟ۡۘۘ";
                                                    continue;
                                                case -936377190:
                                                    str3 = "ۘۚۡۗۛۤ۬۟ۨۘۨۡۥ۟ۢ۟ۖۗۦۘۗ۫ۥۘۚۗ۫ۜۡۘ۟ۢۡ";
                                                    break;
                                                case -419274868:
                                                    str2 = "ۥۤۗۡ۟ۦۥۤۚۖۖۘۘۘۜۘۘۖۚ۬۬۬ۦۗۖۙۙۛۜۙۨۧۘۚۨۜۜۚۗۤۤۡۘۡۘۨۡۥۨۘۥۡۜۘ";
                                                    continue;
                                                    continue;
                                                case 1523737585:
                                                    str3 = OooO0o != null ? "۫ۚۥۧۖۧۘۚۗۧۥۡۡ۬ۛۨ۟ۘۡۗۙ۟۬ۖۖۘ۫ۛۜۦۗ۠ۜۗ۬۠ۡۢۗۨۘۦۤۥۘۖ۫ۥۗۢۡۧ۫ۖۘۛ۟ۘۘ" : "ۜۗۨۥۙۧۛ۫ۖۘۤۡ۟ۥۨۨۢۗۘۜۙ۬ۡ۠ۚۢۖۤۧ۫ۥۚۡۘۗۖۧۘۘۙۤۛۨۤ۬ۗۦ۫ۜۙۜۜۘۘ";
                                                    break;
                                            }
                                        }
                                        break;
                                    default:
                                        continue;
                                }
                            } catch (Throwable th) {
                                throw th;
                            }
                        }
                        break;
                    }
                    break;
                case -1560174251:
                    str = "۠۬ۦۘۚۢۜۢۡۛ۟ۖۧۘۡۘ۟۫ۘۦۘۥۘۢۛۖۜۖۘۢۥۜۧ۬۫ۜۦۚۤۥۘۘ۫۟۫ۜۡۡۘۢۡۢۤۡۦۘ۫ۥ۠";
                    break;
                case 1166594366:
                    String str4 = "ۖۗۗۢ۠ۘۘۛۤۚۡ۠۫ۡۛۚۚۙۜۦۘۘۘۢۙۗۥ۠ۖۘۧۢۨۢۘ۟ۤ۟ۨۘۨۨۡۘۥۘۧۦۦۛۨۡۙۖۘ۬۠ۤ";
                    while (true) {
                        switch (str4.hashCode() ^ 1842128450) {
                            case -2082043077:
                                str4 = "۬ۤۤۚۖۦۜ۫ۦۢ۫ۤ۬۫ۡۘۨ۟ۡۘ۬ۨۥۘ۬ۢۨۘۙ۠۫ۢۚۚۖ۬ۦۥۨۢۖ۟ۦۗۢۢ";
                                break;
                            case -2020576640:
                                str = "ۨۚ۬۟ۡۘۜۦۜۘۗ۬۫ۗۨۥ۫۟ۚۙۘۙ۠ۚۨۜۧۖۦ۬ۨۧۧ۫ۡۨۜۘۚ۠ۘۘ۫۬۬";
                                continue;
                            case -774319824:
                                str4 = OooO0o != null ? "ۦ۠ۡۘ۠ۦۧۗۘۧۘۤۙۛۘۚ۠۟ۘۘۘ۫۟ۢۚۗۢۘۖۧۗۢۛۘۖۖ۬ۘۗۜۢۙ۟ۗ۠۬ۚ۠ۜۙۨ" : "ۡۘۥۘ۬۫ۦۧۖ۬ۤۖۥۥ۫ۥۘ۠ۦۧۘۦۤۚۗۜۡۘۥۖۨۧ۫ۥ۫ۧ۠ۘ۫۫ۡۗۜ۬۠۠";
                                break;
                            case 834160016:
                                str = "۠۟ۢۤۧ۫ۚۜۖۡۧۗۗ۠ۥۥۤۢۜۥۜۘۛۗۤۚۤۥۘۦ۬ۨ";
                                continue;
                        }
                    }
                    break;
                case 1380156566:
                    break;
            }
        }
        return OooO0o;
    }

    public static boolean OooO0Oo() {
        while (true) {
            switch (((("ۦۡ۫ۨۥۧۘۖۦۙۦ۟ۗۤ۫ۧۖۖۦۛۘۘۘۢ۫ۙۤۙ۫ۡۜۘۘۥ۟ۚۧۨۨ۟۟۠ۛ۟ۘ".hashCode() ^ 373) ^ 250) ^ 131) ^ (-1430898606)) {
                case -195654196:
                    return OooO0OO;
            }
        }
    }

    public static void OooO0o(Context context) {
        IntentFilter intentFilter = null;
        String str = "۠ۖۦۦ۟ۦۘۡۥۘۛۘۜ۠ۚۚۤۢۦۘ۟ۗۡۛۚ۫ۨۘ۫ۡۥۖۘۦۥۜۘۜ۟ۘۗۤۙۚۙ۫ۗ۫ۨۙۤۚ۠ۘۘۢ۠ۢ";
        while (true) {
            switch ((((str.hashCode() ^ 494) ^ 232) ^ FragmentManagerImpl.ANIM_DUR) ^ (-1095994626)) {
                case -1298616351:
                    str = "ۛ۠ۘۖۗۘۢۥۚۛۘۙۥۧۜۗۘۦۘۖۥۜۘ۫ۘۗۧ۫۟ۤۖۦۖۥۨۘۙۚۙۗۡۧۙ۬ۨۘۛۦۖۘۨ۬ۜۘ";
                    break;
                case -1165333364:
                    intentFilter = new IntentFilter();
                    str = "ۙ۫ۚ۠ۢۙ۬ۙۗۜ۟ۖۘۜۦۖۗۢۘۘۨۥۡۡۥۨ۟۬ۛۙۙۤ۟ۘۘۘۧۜ۫ۨۚۜۘۗۜۥۧۨۙۗۖۧۘ";
                    break;
                case -916065606:
                    context.getApplicationContext().registerReceiver(OooO0OO(), intentFilter);
                    str = "ۥۚ۫ۢۧۘۘ۠ۘۥۢۡۘۘ۠ۥۖۘۖۤ۬۟ۛ۠ۙۖۥۘ۠ۧۘۢۧۜۘۥۥۘۨۘۗۧ۟۬۟۠ۙۧ۬ۜۜۡۜۧۢ۠ۗ۫ۛ";
                    break;
                case 31002978:
                    intentFilter.addAction(OooO00o);
                    str = "ۖ۬۟ۘۜ۟۫۫ۗ۟ۛۖۜۨۨۧۖ۫ۙۖۜۤۘۡۘۥۥۜۘۙ۫ۘۗۧۨۘ۫ۦۘۖۢۛۘۙۦ";
                    break;
                case 1131063165:
                    return;
            }
        }
    }

    /* JADX WARN: Failed to find 'out' block for switch in B:4:0x0018. Please report as an issue. */
    private void OooO0o0() {
        OooO00o oooO00o = null;
        String str = "ۗۢۜۢۖۘۘۘۨۖۘ۠ۤۡۘۗۖۦۘ۫ۘۦۘۦ۟ۧۡ۟ۜۘۘۛۖۘۦ۫۟";
        int i = 0;
        int i2 = 0;
        int size = 0;
        while (true) {
            switch ((((str.hashCode() ^ 749) ^ 458) ^ 637) ^ 266995729) {
                case -1837142826:
                    str = "ۥ۟ۘۡۖۜۛۜۡۘۜ۫ۛۨۖ۟۠ۨۡۜۡۢ۫ۦ۬ۦۨۨۘۗۘۖۘۤۢۚۘۛ۬ۚۥۥۘۚۗ۫ۤ۟ۧ۫ۥۨۘۡۡۚۖۜ۟";
                    break;
                case -1448610479:
                    str = "۬ۖۛ۫ۖ۫ۘۚۖۛۤۚۥ۟ۜۙۜۡ۠ۧۖۘۧۚۡۤ۫ۦۘ۫ۨۦ";
                    break;
                case -1370168613:
                    String str2 = "ۛ۠ۘۘۖۤۦۥۖۡۜۘۢۨ۠ۧۢۤۖ۟۬۬ۢۢۥۙۛ۟ۤۨ۫ۥۧ۫ۧ۫ۘۘۚۧۦۘ۠ۥۨ";
                    while (true) {
                        switch (str2.hashCode() ^ 1250139084) {
                            case -1030868967:
                                String str3 = "ۖۘۥۤ۫ۨۛۛۢۧ۟ۥ۬ۙۡ۠ۛۥۦۥ۟ۧۡۤۘۖۦۘ۬ۗۧۙۙۨۘ۠ۤۡۘۡۥۥۡۦۤۦ۟ۜۙۖۦ۠ۦ۠ۡ";
                                while (true) {
                                    switch (str3.hashCode() ^ 2082162611) {
                                        case -323796275:
                                            str2 = "ۡ۫ۡۘۥۡۚۧۡۙۢۤ۬ۧۙۘۘ۟۬ۖۧۚ۫ۜۘۦۘۚۛۖۘۗۛۨۘ";
                                            break;
                                        case 140979246:
                                            str2 = "ۥۖۘۘۙۚۘۘۧۗۖۙۡۘۙۜۘۤۘۙ۬۬ۥۘۛۧۤ۟ۥۜۘۡ۬ۙۦۦ۫ۘۨۚ۬ۜۤ۠ۤ";
                                            break;
                                        case 1569383410:
                                            str3 = "ۜۘۥۨۘ۠ۘۡۖۘۦۨۧۘۗۗۦۥ۬ۧۛ۠ۦۙۢۜۚۛۜۗۨۘ";
                                            break;
                                        case 1903873290:
                                            str3 = i2 < size ? "ۥۙۙۦۘۧۘۦۛۙۡ۫۬ۨ۬۟۫ۧۥۘۦۘۡۘۧۜۘۘۗ۬۠ۜۚۛۘۢۡۘۢۙۘۘۡۖ۫ۦۡۜۘ" : "۫ۢۦۘۤۛۜۚ۟۬ۢ۟ۤ۟۬ۜۙۜۦۦ۠ۙۖۗ۫ۧۡۨ۫۬ۗ۠ۛۘۗۨۘۚۙ۬ۗۥۤۡ۟۟ۛ۬ۖۘ";
                                            break;
                                    }
                                }
                                break;
                            case 38530050:
                                break;
                            case 822746977:
                                str = "ۤ۬۬۫ۙ۬ۛۥۜ۟ۜۧۘۙ۫ۨۘۚ۠ۢۧۜ۠۫۫ۦۘۢ۫ۜ۬ۢۙۧۤۖۘۢ۫ۥۘۡۚۨۛۗۡ";
                                break;
                            case 1701382634:
                                str2 = "۬ۖۧۙۡ۫۠ۖۖۨۧۨ۫ۨۦۘ۠ۖۨۢ۠ۗۥۙ۫۠ۖۨۦۘۘۘ۬ۖۨۘۚۢۥۘۧۙۥۘۖۥۨ";
                                break;
                        }
                    }
                    str = "ۙ۟ۛۤۦۖ۫ۧۢۨۤۗۜۨۤۖ۠ۘۘۜۥۤۧ۟ۜۥ۟ۥۘۢۡۨۨۥۘۡ۬ۢۗۚۦۘ۟ۛ";
                    break;
                case -1140474251:
                    str = "ۛ۫ۜۡۛۘۨۖۖۙۨۦۘۨۨۤ۟ۛۢۚۥۚۖۧ۫ۥۖۧۘۛۥۘۘ";
                    break;
                case -682136421:
                    oooO00o.OooO0O0(OooO0Oo);
                    str = "۫ۜۢۨۡ۫ۥۗ۬۠ۛ۬ۛۧۗۢۘۜۨۤ۫ۘۡ۟ۢۢۥۦ۫ۨۡۥۘۜۢۜۘۚۛۥۘۙۡۗ";
                    break;
                case -634273820:
                    str = "ۛۛ۫ۛۤۢۘۢۗۜۡ۫ۛۡۚۘۖ۠ۥۦۜۨۜ۟۟ۛۙۜۛۗۢ۬ۜۦۤ";
                    break;
                case -517483951:
                    String str4 = "ۡ۫ۨۚۖۘۛۡۨۘۖۜۡۘۗۛۥۛۦۜۘۜ۟ۥۡۤۧۛۗۦۘۙۢ۬ۗۨۜۤۛۥ۫۠۟ۖۨ۫ۛۤۚۘ۬ۡ";
                    while (true) {
                        switch (str4.hashCode() ^ 731417026) {
                            case -1306304376:
                                String str5 = "ۨۚ۟ۖۨۧۘۥۙ۬ۧۡۡۘ۬ۦۡۘۦۥۢۨۚۖۢۙۨۥۨۘۨۜۧۡۘۗۘۨۚ۟۬ۘۘۜ۬۟ۥۤۗۗۘۘ";
                                while (true) {
                                    switch (str5.hashCode() ^ 251268758) {
                                        case -1486715931:
                                            str5 = OooO0Oo() ? "۠ۥۡۘۢۢۖۦۢۗۤۤۡۘۧ۟ۥۘۘ۠ۨۘ۠ۛۛۦۨ۟ۖۚۛۜ۬ۢ۬ۧۙۧۚۘ۠ۥۡۘۗۗۡ۟ۗ۟۠ۧۢۙۖۡۜۦۧۘ" : "ۦۙۨۢۘۦۛۡۦۚۢۡۘۡۢ۬ۤ۫ۜۡ۟ۨ۬ۦۥۚۖۤۦۘ۫ۖ۫ۡۤۦۙۗۖۖۘۛۜۧۘ";
                                            break;
                                        case 98573942:
                                            str5 = "ۡۚۙۨۗۤۘۥۜۗۙۦۧۜۙ۠ۨۡۘۤۖۖۘ۬ۦۦۥۙۢ۬ۧۜۘۦۥ۟ۥۛ";
                                            break;
                                        case 202351496:
                                            str4 = "ۚ۫ۜۘۤۥۧ۠ۚۤۤۛۤۚۨۡۖۖۖۨۘ۬۫ۤۘۘ۫۬ۡۘۢۡ۟ۙۖۧۘۧۢۗۧۗۢۜ۬ۜۦۧۘۜۧ";
                                            break;
                                        case 1833163046:
                                            str4 = "ۘۗۦ۠ۨۡۘ۬۠ۥۘ۬ۖۦۦۘۜۛۧۢۨ۠۠ۤ۬ۙ۬ۛۜۚۚ۬ۛ۫ۖۘ۠ۘ۬";
                                            break;
                                    }
                                }
                                break;
                            case -908366706:
                                str = "ۤۤۘۘۢۡۚ۟۟۟ۡۗ۟ۢ۠ۥۘ۬ۦۨۚۨۚۤۚ۠ۢۢۦۘ۠ۦۧ۫ۗۦۘۦۛۘۛ۠۠ۗۖ۟ۜۥۘۘۤۘ";
                                continue;
                            case 466809171:
                                str = "ۚۚۙۢۛۧۖۦۨۨۢۚ۟ۤ۠۫ۥۖۘۡ۠۬ۡۚۨۘۜۢۤ۠ۜۢ۬ۜۦۥۨ۫ۗۗ۫ۡۡۖۖۥۧۨۡ";
                                continue;
                            case 857048253:
                                str4 = "ۤۚۨۦۢۘۘ۫ۗۙۙۛۡۘۢۖۛ۟ۚۡۦۢۡۘ۫ۘۘۨۛۖۙ۫ۥۖۨۙ۠۠ۜۖۛۨ۬۠";
                                break;
                        }
                    }
                    break;
                case -510243528:
                    str = "ۛ۫ۜۡۛۘۨۖۖۙۨۦۘۨۨۤ۟ۛۢۚۥۚۖۧ۫ۥۖۧۘۛۥۘۘ";
                    i2 = 0;
                    break;
                case -484499579:
                    i = i2 + 1;
                    str = "ۚۛۖۘۜۙۨۤۨۙۜ۟۬ۚۢۢۘۨۢۡ۬ۙ۫ۘۛۥ۟۫ۙۨۥۦ۟۬۬ۡ۫ۗۤ۠";
                    break;
                case -433683092:
                    size = OooO0o0.size();
                    str = "ۥۥۖۚۛۗۢۥۧۙۥۤۙۨۘۜۗۨۚۢ۬ۜۗۛۗۜۡۘ۬ۨۦۘۖۧۖۗۥۖۗۨۘۘ۬ۤ۟ۨۙۤۨۥۘۜ۬۟۟ۥۖۘ";
                    break;
                case 40375129:
                    break;
                case 424036125:
                    String str6 = "ۥ۠ۗۗ۠ۥۘۚۗۦۡۨۚۡۙۨۘ۠۬۟ۦۜ۬ۦ۫ۘ۟ۜۖ۫ۤۡۘۢ۫ۘۘۜۦ۠۠ۗ۫۠ۘۛۖۛۖۘۢ۫۬";
                    while (true) {
                        switch (str6.hashCode() ^ (-613297807)) {
                            case -1401416126:
                                break;
                            case 255695698:
                                String str7 = "ۛۚۢۗ۟ۨۘۤۨۘۖۜۡۘ۬ۛۘۢۦ۠ۙۨۧۘ۬ۢ۠ۨۜۖۧ۟ۘۛۙ۫ۢۦۢۨۛ۫ۥۚۜۘ";
                                while (true) {
                                    switch (str7.hashCode() ^ 1450484417) {
                                        case -1878115566:
                                            str6 = "ۦۤۛ۟ۜۦۗۤۦۢۥۙۨۚۙۙۨ۬۬ۥ۫ۨۚۦ۟۠ۦۘۘۚۛ۟ۧۤۦ۟ۧۥۤۨۘۚۧۦ";
                                            break;
                                        case 380939725:
                                            str6 = "ۥۧۙۙۖۖ۬ۘۦۘ۬ۖۦۘۘۥۨۘۖ۬ۜۘ۬۠ۖۘۨۦۦۤۨۨۥۘۛ۬ۧۚۥۨۘۥۗ۫ۘۙۛۖ۬ۥۦۖ۬";
                                            break;
                                        case 540405464:
                                            str7 = oooO00o != null ? "ۘۨۗ۫ۙۦ۬ۨۚۘۡۘۥۥۤ۬ۘۨ۟ۡۛۜۚۤ۬ۨۤۛۖۗۨۛ۫۟ۚۡۖ۟ۢۤ" : "۠۫ۥۘۦۧۘۘۘۨ۫ۡ۫۫ۚۛۡۖ۠ۛۢۜۧۘۙۛۨۘ۫۫ۧ۠ۥۖۡۜ۫ۤۛۡۖۦۜۛۘۥ";
                                            break;
                                        case 1558974165:
                                            str7 = "ۙ۟ۖۥۛۜۘۖ۟ۛ۬۟ۦ۫ۖۤ۬۫۠ۢۜۢۛۡۚۡۜۗ۬ۥۗۚۚۨۢۧۜۜۨ۬۫ۖۘ۠ۦۦۘۙۙۙ";
                                            break;
                                    }
                                }
                                break;
                            case 1795108798:
                                str6 = "ۢۢۖۘ۠ۛۦۘۨۦ۠ۦۡۧۤۦۡۘۢۡۖۤۧ۠ۖۘۗ۬ۖۡۛۧ";
                                break;
                            case 2122971383:
                                str = "ۤۗۖ۬ۥۚ۟ۜۥۙۙۧۤۥۦۧۨۡۘۖۙۖۘۘۢۤۥۖۜۘ۬ۡۜ۬۬ۢۛۢۜۦۖۧۗۖۘ";
                                break;
                        }
                    }
                    break;
                case 927388965:
                    oooO00o.OooO00o();
                    str = "ۥ۟ۘۡۖۜۛۜۡۘۜ۫ۛۨۖ۟۠ۨۡۜۡۢ۫ۦ۬ۦۨۨۘۗۘۖۘۤۢۚۘۛ۬ۚۥۥۘۚۗ۫ۤ۟ۧ۫ۥۨۘۡۡۚۖۜ۟";
                    break;
                case 931275483:
                    String str8 = "۫۟ۧۧۨۛ۟ۗۥ۫ۙۤۨۨۘۤۙۢ۫ۙۗۤۗۢ۟ۛۗ۟ۗۢۘۨۜۘۦۗ";
                    while (true) {
                        switch (str8.hashCode() ^ 2026851465) {
                            case -1819744990:
                                break;
                            case -169472037:
                                str8 = "ۗۗۥ۟ۙۖۛۛۜۗ۟ۨۘۨۦ۬۬ۚۢۡۛۖۖۚۜ۫۠ۛ۫ۗ۠۬ۤۛ۠ۥۘۘۥۦۨۨۢۖۘۧۖۛۦۚۗۘ۬۠ۗۜۗ";
                                break;
                            case 21486380:
                                str = "۫۬ۛۡ۬ۡ۬ۘۨۚۨۖۘۢۥۥۖۥۢۛۨ۟ۢۘۗۖۢۙۥۖۛۢۤۖۘۨۢۖۦۦۡۤۖۦۘۚۜۘۘۖۤ۬ۥۤ۫ۡۘۨ";
                                break;
                            case 82615582:
                                String str9 = "ۙۗۦۤ۟ۛۜ۬ۨۘۦۚۘۦۥۢ۬ۦۦ۟ۢۨۖۜۦۘ۟ۦۦ۬۬۬ۢۡۘۢۥۡ";
                                while (true) {
                                    switch (str9.hashCode() ^ 1594558374) {
                                        case -1997826948:
                                            str9 = !OooO0o0.isEmpty() ? "ۨۖۨۘ۟۟ۢۗۚۙۨ۠ۧۘ۠ۥۘۘۖۘۡۜۙۗۚۤۚۦ۠۬ۦۖ۟ۖۖ۫ۧ۫ۛۙ۫۠ۛۨۘۢۙۦۛۙۨۥۚۖۘۨۜۜ" : "ۤ۬ۜۜۗۨۖۚۘ۠ۢۙۢ۠ۧۙۗ۟۠ۧۡۚۤۨ۫ۡۡۥۛۛۤۦۛۘۙ۠ۗ۠ۜۘۥۨۖۘ۫ۚۨ۟ۘۘۘ";
                                            break;
                                        case 1135814013:
                                            str9 = "۟ۥۗۚۢۦۘۧۨۧۘۦۤۨ۬ۦۨ۟۬ۙ۫۠ۖۘۧۡۘ۟ۡۖۘۘۡۘۨۨۢۨۢۦ";
                                            break;
                                        case 1570954486:
                                            str8 = "ۚ۠ۤۜۙ۠ۘۤۜۘۥۨۗ۫ۜۦۦۗۨۗۙۧۡۢۜۘۢۜۦۘۤۘ۟۫ۤۡۡۦۙ۫ۤ";
                                            break;
                                        case 1791187039:
                                            str8 = "ۚۖۦۘۡۢۙۨ۠ۧ۠ۡۗۢ۟۠۬ۢۙ۬ۧ۠ۛۗۢۘۦۘۜۖ۟ۖۘۡۗۗ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
                case 1059833276:
                    str = "۠ۡۛۥۘۘۦۖ۫ۧ۬ۢۥۧ۟ۛۨۚۘۛ۠ۜۦۥۘۦۢۘۜۙۜۜۖۖۤۜۨۘۤ۬ۜۘۦۛۛ";
                    i2 = i;
                    break;
                case 1422226465:
                    str = "ۛۚۘۘ۠ۦۦۘ۠ۨۚ۬ۖۗ۬ۦۘۖۘۖۡۥۗۙۦۗۥۤۛۙۗۖۖۘۧۘۜۘۥۘۖۛۥۘ۠ۘ۬ۘۚۢ۠ۚۘۢۥۡۘۨۚ۟";
                    oooO00o = OooO0o0.get(i2);
                    break;
            }
            return;
        }
    }

    public static void OooO0oO(OooO00o oooO00o) {
        String str = "۟ۛۛۥۤۢ۠۟ۨۘۚۙۜۛۖۘۘ۫ۦۖۘۤۧۖۘۛۜۡۧۢۡۨۢۜ۠ۢۥۜۡۘۤۧۘ۫۟ۤۡۖۛۚۦۛۚۜ۟ۘ۬ۖ";
        while (true) {
            switch ((((str.hashCode() ^ 267) ^ 827) ^ 468) ^ (-516707523)) {
                case -1245529417:
                    str = "ۢۡۜۘۤۥۧۘۨۥۙۦ۬ۛۡۤۨۛۗ۟ۤۦۜۘۖۜۤۙۨ۠۠ۚ۫۫ۧۨۙۡۡۘ۬ۧۘۥ۟۟ۡۡۖۘۦۨۗۚۖۛۡۙۖ";
                    break;
                case -341626192:
                    OooO0o0.add(oooO00o);
                    str = "ۤۡۡۦۧۡۘۙ۠ۜۘ۠ۧۥۘۛۜۥ۫۬ۛۦۢۚ۫ۢۢۖۜ۟ۨۨۘۖۚۙ۬۬ۗۡۡۤ۫ۛۙ";
                    break;
                case 389618807:
                    OooO0o0 = new ArrayList<>();
                    str = "۟ۙۖۘ۠ۚۡۡ۟ۨۨۛۜۘۘۜۧۘ۫ۘۤۘۥۡۘۨ۠ۡۥۖۖۘۢۦ۟ۨۙۡۖۖۖۘ۫۟ۧۗ۫ۤۨۢۥۘۖۨ۠";
                    break;
                case 745105531:
                    return;
                case 1962706754:
                    String str2 = "۫ۛ۫ۡۨۨۢۥۥۘۛۥۙۥۜۡۥ۠ۨۛۖۧۘۧۡۜۧۙۤۙۛۨ۠ۜ۟ۛۚ۠ۥ۬ۢۥۧۛ";
                    while (true) {
                        switch (str2.hashCode() ^ 734524167) {
                            case -1311259816:
                                str2 = "ۢۘ۬ۜۤ۫ۤۡۢ۬ۗۢۙۜۡۘۦ۫ۖۘۚۖۘۘ۠ۡۨۘۗ۫ۘۘۙۗۥ۬ۛۧۘۤۦۤۥ۠۬ۜۖۡۧۙ۟۫ۙۚۥۧۘ۫ۧۘۘ";
                                break;
                            case -535133370:
                                str = "ۖۗۖۘۨ۠ۥ۫۬ۖۨۚۙۙۘۘ۟ۘۖۘۨۥۗۦۘۨۘۚۘ۬ۜ۬ۖ۟ۜ۬ۗ۟ۦۡۛۖۚۗ۫ۥۜۚۙۡ";
                                continue;
                            case 641055372:
                                str = "۟ۙۖۘ۠ۚۡۡ۟ۨۨۛۜۘۘۜۧۘ۫ۘۤۘۥۡۘۨ۠ۡۥۖۖۘۢۦ۟ۨۙۡۖۖۖۘ۫۟ۧۗ۫ۤۨۢۥۘۖۨ۠";
                                continue;
                            case 1286835255:
                                String str3 = "ۦ۟ۘۘۤ۫۠ۚۥۦۘۡ۬ۦۘۜۧۜۗ۟۠ۧ۬۬ۗۖۤۢۚۦۖۦ۠ۛۙۜۘۜۨۜۘۙۥۜۖۚۨ";
                                while (true) {
                                    switch (str3.hashCode() ^ 1568158468) {
                                        case -1619120359:
                                            str3 = "۠ۛۛۢۨۧۤۛۦۘۛۜۛ۟ۚۡۘۥۡۨۙۜۡۘۜۢۘ۠ۦۖۛۚۦۘۙۙۗۖۗۛ";
                                            break;
                                        case -636995021:
                                            str3 = OooO0o0 == null ? "۫ۦۥۘۤ۟ۗۗۙ۟۫ۘۦ۟ۥۢۤۜ۫ۖۨۘۗ۠ۘۘ۬۟ۙۡۨۘۗۨۛۦۤۧۦۙۖۙ۬ۨۘۙ۫ۥۘۡۘۧ۟ۖۖ۫ۦ" : "ۥۥۛۗ۫ۨۤ۫ۜ۫ۥۘۘۢۗۙۦ۠ۙۦ۟ۢ۠۠ۖۘۚ۬ۙ۫ۘ۬";
                                            break;
                                        case 931588082:
                                            str2 = "ۥ۫ۦۥ۫ۖۘۢ۠ۘۘۜۤۢ۟ۜۛ۬۠ۜۘ۠ۗۨۘۚۖۘۘۢۚۦۘ۫ۤ۟ۚۥۢۨ۬ۜۦ۬ۜۘۢۘۖۥۦۥۘۜ۬ۡ";
                                            break;
                                        case 1091133654:
                                            str2 = "۫ۧۤۜۤ۫ۦۨۘ۠ۜۨۛ۟ۡۙ۬ۢۗۡۡۘۙۧۤ۫۠ۖۙۦۦۘۜۡۚۤ۬ۦۤۤۦۘۤۖۨۘ";
                                            break;
                                    }
                                }
                                break;
                        }
                    }
                    break;
            }
        }
    }

    public static void OooO0oo(OooO00o oooO00o) {
        ArrayList<OooO00o> arrayList = null;
        String str = "ۖۡۜۘۗۤۦۘۙ۫۬۟ۜۢۖ۟ۢۢ۠ۖۘۖۥۜۘۘۥۙۨ۠۟ۗۡ";
        while (true) {
            switch ((((str.hashCode() ^ 96) ^ 509) ^ 46) ^ (-762446342)) {
                case -1553052822:
                    return;
                case -890453478:
                    OooO0o0.remove(oooO00o);
                    str = "ۢۜۖۖۤۖۘۡۜ۫ۤ۫ۤۢۖۚۚۙۘۘۘ۫۟ۧۛۘۘۧۜۜۘ۟ۘۥۘ۫ۖۤۘۨۛ";
                    continue;
                case 265949233:
                    str = "ۚۢۙۡۘۜۘۦۥۧۘۧ۬ۛۙۡۛۥۛۦ۠ۨۘ۠ۘۥۧ۫ۨۘۧۙۗۗۥۛۥۚ۠ۗ۟ۦ۠ۙۜۘۚۘۦۙۘ۟";
                    continue;
                case 919309873:
                    arrayList = OooO0o0;
                    str = "ۙۨۡۘ۟ۜۦۘۦۥ۫۫ۤۦۖۙۚۥۡۤۧۜ۠ۨۢۜۘۥ۬ۡۘ۬ۦۛۖۚ۬ۗۥۘۛۗۨ۟ۧۨۖۦ۠ۚۚ۬۟ۥ۫ۧۨۘ";
                    continue;
                case 933936516:
                    String str2 = "ۤ۬ۦۥۜۖۘۡۤۤۤۥۨۨۧ۟۫ۚۦ۟۠ۚۛۥۨۧۚۡ۟ۗۡۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 388474634) {
                            case -1255126066:
                                String str3 = "ۙۘ۟ۘۜۛۤۚۚ۟ۘۨۦ۟ۤۡۦۨۘ۠ۤۙ۬ۖۘۙۘۜۤۗۧۧ۫ۘ۟ۗۢ۬ۥۗۗ۬ۛۥۘۘۖ۬ۢ";
                                while (true) {
                                    switch (str3.hashCode() ^ 204806034) {
                                        case -1412489407:
                                            str3 = arrayList != null ? "ۚۛۨ۟ۡ۫ۡۖۚ۠ۚۖۘۢۧۥۘۤۜۘۘۨۛۨۘۧ۠ۥۥۙۘۧۘۛۧۖۜۘ۫ۛۚۥۜ۠ۚۜۦۖۢۨۘۡۗ۠" : "۟ۖۜۘۖۧۦۥ۠۫ۢۚۥ۟ۤۘۡۚ۬ۘۜۘۘۛۗۨۘۡۚۙ۫ۙۚۧۤۘۘۖۘۜ۫ۡۧ۠ۙۧ";
                                            break;
                                        case -1404446387:
                                            str2 = "ۦۦۖۘۘۜۜۘۥۨۖۘ۬۟ۦۜۤۗۤۚۘۦۨۗ۬ۘۤ۟ۡۨۙ۫۫ۛۖۘۡۤ۠ۘۡ۬ۗۥۙ۠۫ۧۖ۫ۘۘ";
                                            break;
                                        case 185339760:
                                            str2 = "ۧۜۛۢۥۘۘۡۢۢۡ۠ۢۤۛۚۦۜۘ۟ۢ۬ۢۤۛۗۡۧۘۡۡۙ۫ۜۗ۬ۥ۠ۧۧ۠ۢۛۘۘۦ۟ۛ۟ۚۢۘۦۛۗ۠ۗ";
                                            break;
                                        case 1104735590:
                                            str3 = "ۛ۟ۦۨۗ۬ۚۛۚۥۗۘۘ۠ۚۜۘۗۧۖۥۥۛۦۥۙ۠ۡ۫۠ۘۘۗۢۥۨۢۡ";
                                            break;
                                    }
                                }
                                break;
                            case 3976414:
                                break;
                            case 1186430189:
                                str = "ۛۤۥۡۢۥ۫۠۠۬ۡۘۥ۫ۦۡۙۢۤ۟ۖۖۧۡۘۙۥۥۘۖ۫ۜۘۗ۬ۘۘ۫۠ۥۖ۠ۨۘ۟۟ۡۘ";
                                break;
                            case 1235627440:
                                str2 = "۠۟ۜۘۛۢۥۗ۫ۗ۟ۗ۬ۢ۫ۘۘ۬۟ۨۘۛۚۡۘۘ۫ۡۖ۟ۥۙۖۘۛۨ۟ۘۖۘۖ۫ۧۗۡۤ";
                                break;
                        }
                    }
                    break;
                case 2089684554:
                    String str4 = "ۖۨ۬ۘۧۦۘۚۛۨۘۜۘۚۨۜۜۘۗ۟ۡۦ۬ۥۚۦۢۦۥۗۥۖۙۡۡۘۤۙۚۖۗۖ۠ۖۧ۬ۧ۠۬ۗ۫ۖۤۖۘ۬ۨ۟";
                    while (true) {
                        switch (str4.hashCode() ^ 1996524914) {
                            case -1667865946:
                                str = "ۧۚ۠۬ۘ۬ۙۚ۫ۨ۟ۥۘۢۧ۫ۙۙۘۛۜۡۙۗۢ۠۠ۖۘۡ۟۟ۙۢ۠ۛ۟";
                                break;
                            case -1303868989:
                                String str5 = "ۜ۠۬ۧۥۥۦۜۤۦۢۘۘۗۡۨۘ۠ۢۜ۫ۘۢۢۛ۬ۜۦۨۡۧۦ۟ۚۥۧۤۜۖۨۘۨۛۨۗۤۛۤۥۡۡ۟۫ۢۢ";
                                while (true) {
                                    switch (str5.hashCode() ^ (-1760563431)) {
                                        case -1711362086:
                                            str4 = "ۨ۟ۦۘ۫۬ۢ۬۫ۙۨۦۜۘۧۢۦۘۦ۫۬ۗۡۛۗۙۤۛۢۦۘ۫ۡۘۤ۠ۘۖۥۖ۫ۨۦۛۦۜۦ۟ۘۦۗ";
                                            break;
                                        case -865203397:
                                            str5 = arrayList.contains(oooO00o) ? "ۜ۫۫ۚۤۡۦۚۢۥۗۤۢۜۥۚۛۜۦۧۘ۫۟ۡۘۡۖۨۘ۫ۧ۫ۧۖۤۗۘۘۤۗۘۦۦۘۖۢۧۧۤۢ۫ۨۖۘۗ۫ۛ" : "ۙۨۡ۟ۤۚۤۜۘۚۦۦۦۗۡۘ۠ۜۤ۠ۛۦۘ۫ۘۡۘ۬ۙۦۘ۟ۛ۠ۗۜۙ";
                                            break;
                                        case -490820365:
                                            str4 = "ۗۚۖۘۧۛۨۘ۫ۛۦۘۘ۟ۦۖۡۥۘۨۥۜۘۖۡۛۗۨۨۘۛۨۧۘ۫ۨ۬ۨۗۥۗۙۡۘۘۦ۠ۧۦۘۘۘۤ۟ۛۚۛۙۘۚۦ۟ۖ";
                                            break;
                                        case 470194635:
                                            str5 = "ۜۤۢۧۖۡۘۦۗۚۥۛۤۘۧۙۘۥۡۚۥۗۚۤۧۤۡۛۢۗۥ۫ۥۗۙ۠ۨۘۢۗۤۤ۟ۖۘ";
                                            break;
                                    }
                                }
                                break;
                            case 357522353:
                                break;
                            case 558230410:
                                str4 = "ۢۜۡۙۧۖۗۨۖۡۛ۠ۥۜۤۘ۠ۛۤۙۦۧۧۙۘۖۚۛۦۘۘۢۨۖ۫ۘۚۡ۫۟ۥۨۘ";
                                break;
                        }
                    }
                    break;
            }
            str = "ۢۜۖۖۤۖۘۡۜ۫ۤ۫ۤۢۖۚۚۙۘۘۘ۫۟ۧۛۘۘۧۜۜۘ۟ۘۥۘ۫ۖۤۘۨۛ";
        }
    }

    @Override // android.content.BroadcastReceiver
    public void onReceive(Context context, Intent intent) {
        String str = "ۜۨۥۛۙۢۨۤۚۚ۠۫ۨۜۘۘۤ۟ۤ۟۟ۥۘ۬۫ۘۨۧۚۡ۫ۦۖۗۛۜۨۦۤۧۗ۫ۨۤ۬ۨۖۡ";
        while (true) {
            switch ((((str.hashCode() ^ 176) ^ 1009) ^ 50) ^ (-1456747835)) {
                case -2119055813:
                    String str2 = "ۡۙۗۛۨۘ۬۫ۜۤۜ۬ۧۥۢ۟ۡۗۛۢۜۡ۬ۢ۫ۡۢۦۘ۟ۘۥۘۡۜۦۘ";
                    while (true) {
                        switch (str2.hashCode() ^ 1132185872) {
                            case -1781545295:
                                String str3 = "ۡۛۘۘۢۥۥ۠۟ۨۜۥۥۘۗۚۚۛ۬۬ۨۙۘۘۖۡۥۘۢۥۥۢۙۗۗۨۢۧۥۤۛۤۖۘۚۙۖۡۦ۫ۙۙۤ";
                                while (true) {
                                    switch (str3.hashCode() ^ (-1445963514)) {
                                        case -1386922530:
                                            str3 = "ۖۚۜۘۧۢۦۦۡۖ۠ۛۜۘۗ۟ۘۘۡ۫ۦۢ۠ۛۤ۟ۚۘۘۗۖۥۘۧۖۧۘۧۚۤۨۙ۟ۖۙۢ";
                                            break;
                                        case -894336217:
                                            str2 = "۫ۨۗۧۦۥۘۢۧۜۘۤۚۙ۟ۜۘۘۢ۟ۧ۫ۡۚ۠ۥۘۘۢۢۡۘ۟۠ۚۘۘۨۥۦۢۘۗۤۧۜۘ";
                                            break;
                                        case 768327336:
                                            str2 = "ۦۗۖ۟ۙۘۘ۫ۙۥۘۦ۟ۦۘ۫ۨ۟ۨۜۧۘۖۘ۬ۦۛۨۘۛۙۥۤۘۤ۫۠ۜۜۖۥۨۛۡۜۖۤۖۡۘ۠ۘ۫ۙ۠ۡۘ۬ۨۜ";
                                            break;
                                        case 1192077409:
                                            str3 = intent.getAction().equalsIgnoreCase(OooO00o) ? "۠۫ۨ۫۬ۜۘۥ۬ۥۘۜ۫ۦۨۚۡۛۗۡۛۖۘۖ۠ۥۖۜ۟ۘ۠ۙۚۖۜۘۚ۫۠۬ۢۗ۬ۛ۠" : "ۜۤۙۙ۫۟ۖۘ۠ۧۘۥۘۦۛۖۘۢۤۜۥۚۛۘۨۥۨۢۢ۟۫ۦۘۤۦۨۘ۠ۜۥۘۗۦ۫ۧۘۤ۠ۨۘۗ۬ۡ";
                                            break;
                                    }
                                }
                                break;
                            case -1576512215:
                                str = "ۦ۬ۚۦۤ۬ۚۤۦۘ۬۟۠ۦۦ۫ۧۜۧۢۧۨۘۛۜۤۚۘۦۗۜۘ۟۫ۧۨۜۨۘۢ۫ۘۛۨۜ";
                                continue;
                            case 489045328:
                                str = "ۤۙ۬۬ۤۥۘۨۦۡۗ۫ۢۢۡۘۚ۫۠۠ۘ۟ۛ۠ۜۘۘۖ۫۠ۛ";
                                continue;
                            case 1567675543:
                                str2 = "ۚۜۚۨۧۗۜ۬ۘۘۡۨۧۢ۫ۘۘ۠ۢۘۗ۠ۖۘۢۧۛۥۧۢ۠۫ۖۜۙۙ۟ۙۖ";
                                break;
                        }
                    }
                    break;
                case -1941184985:
                    str = "ۖ۠ۘۖۡۡ۫ۚ۠ۚۧۚۚۢۘۛۚۥ۬ۥۘۨۦۤ۬ۨۢۥ۠ۙۗ۠ۥۙۘۗ۟ۚۧۨۧۛۖۤۧۖۘ۠";
                    break;
                case -1887743883:
                    return;
                case -1842484331:
                    str = "ۚۢۜۚۢ۠۬۠ۨۘۚۡۥ۠ۛۦۘۙۧۢۧۧۜۛ۠ۗۛۜۘۜۧ۠ۤۘۗۢ۫ۘ";
                    break;
                case -1748888120:
                    str = "ۗ۠ۨۡۗۡۘ۠ۘۜ۫۫ۧۦۦۧۘۦۥۜۘۨۡۗۥۦۘۛۜۥۨۜۥ۬ۥۚۧۧۛۜۗۤۨۢ۟ۧۡۡۦۗۨۖ۬ۨ۠ۡۡۘ";
                    break;
                case -1308039113:
                    getClass().getName();
                    str = "ۜۤۢ۬ۛۘۘۡ۫ۡۢ۬۫ۘۗ۠ۦۜۡۘۖۜۨۘۡ۬ۜۘۜۥ۬ۜۦۘۗۙۜۘۧۢۡ";
                    break;
                case -1241321902:
                    String str4 = "۠ۦۧۘۦۙۤۥۥۚۜۤۦ۟ۡۧۘۤۜۥۘۘۧۢۢۡۦۘ۬ۡۦۘۤۡۚۡۚۗۛۦۥۛۡۥۘ۫";
                    while (true) {
                        switch (str4.hashCode() ^ 142759936) {
                            case -945164472:
                                String str5 = "۟ۙ۠۟ۨۖۥۤۘۘۧۗۖۘۡۜۡۘۛۗ۫ۢۥۖۘۦۛۚۥۚۥۘۗ۠ۦۨۙۖ۫ۨۨ۟ۗ۫ۙۘۢۢۤۘۘۢۚ۠";
                                while (true) {
                                    switch (str5.hashCode() ^ (-1128819125)) {
                                        case -1691341617:
                                            str4 = "ۙ۫۟ۧ۠ۘۧۙۦۘ۬۬ۛۧۖۖ۫ۗۖ۬۠ۖ۫ۜۥۘۡۖ۠۟ۥۢ";
                                            break;
                                        case -941345943:
                                            str5 = "ۖۨۚ۠۠ۜۘ۠ۗۡۘۤ۠ۘۘۖۜۧۘ۠ۢۗۡ۟۬ۖۚۙۢۦۥۘۤۛۙ۠۬۠۟ۧۘۘۧۨۜۘ۟۬ۖ۟ۤۦۘ۟ۧۜۘۜ۬ۗۙ۠ۘ";
                                            break;
                                        case -380955715:
                                            str5 = !C4381t4.OooOO0(context) ? "ۡ۫ۨۘۨ۫ۗۧۤۥۘۚ۬ۦۘۘۨۤ۬ۦ۟۬ۤۥۥ۟ۦۨۖۘ۬۠ۢ" : "ۥۢۜ۬ۨ۟ۗۘۧۛۦۖۗۦۤ۬ۖۘ۫۟ۘۦۗۢۘۜۡۘ۬ۧۖۘۡۢۛۥۧ۫ۥۢ۟۬ۤۘۘ";
                                            break;
                                        case -47498686:
                                            str4 = "۠ۙۚ۟۟ۡ۟ۗۨۘۛۡۘۘۦۗۥۘۢۚۚۚۦۨۘۖ۬ۜۘۙۨ۠۠۫۠";
                                            break;
                                    }
                                }
                                break;
                            case -585175349:
                                str = "ۗۖۢۢۗۖۘ۠ۥۗ۟ۡۦۘ۬ۜۤۖۨۢۖۡۚۗۢ۫۠ۛۢۜ۬۠ۥۘۘۧ۟ۦ۟ۧۙ۬ۥ۫";
                                continue;
                            case 606975983:
                                str = "ۦۤۦۤۚۜۨ۬ۙۖۢۢ۬ۨۖۘۚۧۨۘ۠ۗ۠۬ۦۛۢ۬ۖۙ۟۟ۡۨۜۤۨۡ۫ۨۖۘۘۙۢۦۗۦ۫ۦۜۨۖۥۘ۫ۤۢ";
                                continue;
                            case 1138786274:
                                str4 = "۟۫ۚ۬ۤۜۘۧۨۘۜۥۜ۬ۨۘۘۥ۬ۗۨۤۖۘ۫ۥۚ۬ۘۢۖۧۖۘۧۤۥ";
                                break;
                        }
                    }
                    break;
                case -810583410:
                    str = "ۦ۬ۡۡۧۨۘۦ۫ۚۜۛۡۗۙۖ۠ۚۛ۫ۚۘۢۦۢ۠ۥ۫ۚۘۘۖۗۘۡۖۙۥۜۨۘۙۥۖۘ";
                    break;
                case -704768819:
                    OooO0OO = false;
                    str = "ۢۨۦۘ۬ۚۦۘۙۡۥۡۨۢۛۖۥۘ۫ۧۦۘۙۨۖۘ۫۠ۜۘۨۥۤ۫ۧۤۘ۬ۨۘ۫۫ۤۥۥۤۧ۬ۨۘۚۦۚ۠ۜۜۘ";
                    break;
                case 480223996:
                    OooO0o = this;
                    str = "ۨۨۜۘۡۗۦۘۗۧۡۡ۠ۡۘ۟۬ۡ۠۟ۡۛۤۨۘۖۛۢۥ۠ۜۙۨ۟ۖۡۗۢۖۘۘ۠ۘۧۘۢۨۘۘ";
                    break;
                case 1246708026:
                    getClass().getName();
                    str = "ۘۡۢۡۘۘ۠ۖۜۘ۫ۚۧۘ۬ۦ۫ۧۗ۫۫ۘۧۗۚۤ۠ۦۥۧ۬ۖۚۘۢۖۖۘۦۜۖۜۨۖ";
                    break;
                case 1621063283:
                    OooO0OO = true;
                    str = "ۥۛۤ۠ۗ۬ۥۖۥۘۨ۟ۘ۟ۢۖۘۥۨۡۘۘۥۦۚۙۗۜۛۢۜۖۗ۬۠ۨۘۨۧۘ۟ۘۥۚۦۦۘ۬ۡۜۘ۠ۢۜۘۤۘۨ۟ۥۖ";
                    break;
                case 1715901624:
                    OooO0Oo = C4381t4.OooO0OO(context);
                    str = "ۦ۬ۡۡۧۨۘۦ۫ۚۜۛۡۗۙۖ۠ۚۛ۫ۚۘۢۦۢ۠ۥ۫ۚۘۘۖۗۘۡۖۙۥۜۨۘۙۥۖۘ";
                    break;
                case 1963572416:
                    OooO0o0();
                    str = "ۤۙ۬۬ۤۥۘۨۦۡۗ۫ۢۢۡۘۚ۫۠۠ۘ۟ۛ۠ۜۘۘۖ۫۠ۛ";
                    break;
            }
        }
    }
}
